Enums/СпособыПодтвержденияКриптоопераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпособыПодтвержденияКриптоопераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КаждаяОперация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СессионныйТокен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДолговременныйТокен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonForms/НастройкаПодтвержденияКриптоопераций/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПрограммноеЗакрытие;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ЦиклКриптооперации	= Истина;
	Сертификат 			= Параметры.Сертификат;
	СвойствоСертификата	= ЭлектроннаяПодписьВМоделиСервиса.СвойстваРасшифрованияПодписанияСертификата(Сертификат);
	
	Если Параметры.Свойство("СпособПодтвержденияКриптоопераций") Тогда
		СпособПодтвержденияКриптоопераций = Параметры.СпособПодтвержденияКриптоопераций;
	Иначе
		СпособПодтвержденияКриптоопераций = СвойствоСертификата.СпособПодтвержденияКриптоопераций;
	КонецЕсли; 
	
	Если Параметры.Свойство("ЦиклКриптооперации") Тогда
		ЦиклКриптооперации = Параметры.ЦиклКриптооперации;
	КонецЕсли;
	
	ОтпечатокСертификата = ЭлектроннаяПодписьВМоделиСервиса.НайтиСертификатПоИдентификатору(Сертификат);
	
	Если Не ЗначениеЗаполнено(СпособПодтвержденияКриптоопераций) Тогда
		СпособПодтвержденияКриптоопераций = Перечисления.СпособыПодтвержденияКриптоопераций.СессионныйТокен;
	КонецЕсли;	
	
	Если СпособПодтвержденияКриптоопераций = Перечисления.СпособыПодтвержденияКриптоопераций.СессионныйТокен Тогда
		СпособПодтвержденияКриптооперацийБулево = 1;	
	Иначе
		СпособПодтвержденияКриптооперацийБулево = 0;	
	КонецЕсли;
	
	Результат = СервисКриптографии.ПолучитьНастройкиПолученияВременныхПаролей(СервисКриптографииСлужебный.Идентификатор(Сертификат));
	
	ТелефонДляПаролей = Результат.Телефон;
	ЭлектроннаяПочтаДляПаролей = Результат.ЭлектроннаяПочта;
	
	НачальноеЗначениеСпособаПодтвержденияКриптооперации = СпособПодтвержденияКриптоопераций;
	
	УправлениеФормой(ЭтотОбъект);  
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПрограммноеЗакрытие	= Ложь;
	Элементы.СпособПодтвержденияКриптооперацийВыключатель.Подсказка = 
			ЭлектроннаяПодписьВМоделиСервисаКлиентСервер.ПолучитьОписаниеСпособовПодтвержденияКриптоопераций();
	ОбновитьОтображениеСертификата();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ПрограммноеЗакрытие <> Истина Тогда
		ПрограммноеЗакрытие = Истина;
		Отказ = Истина;
		
		ЗакрытьОткрытую(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособПодтвержденияКриптоопераций1ПриИзменении(Элемент)
	
	Если СпособПодтвержденияКриптооперацийБулево Тогда
		СпособПодтвержденияКриптоопераций = ПредопределенноеЗначение("Перечисление.СпособыПодтвержденияКриптоопераций.СессионныйТокен");
	Иначе
		СпособПодтвержденияКриптоопераций = ПредопределенноеЗначение("Перечисление.СпособыПодтвержденияКриптоопераций.ДолговременныйТокен");
	КонецЕсли; 
	
	ШагАвторизации = 4;
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьОткрытую(ПараметрыФормы)
	
	ПрограммноеЗакрытие = Истина;
	
	Если ПараметрыФормы = Неопределено Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("СпособПодтвержденияКриптоопераций", НачальноеЗначениеСпособаПодтвержденияКриптооперации);
		ПараметрыФормы.Вставить("Выполнено", Ложь);
		ПараметрыФормы.Вставить("Состояние", "ПродолжитьПолучениеМаркераБезопасности");
	КонецЕсли;
	
	Если Открыта() Тогда 
		Закрыть(ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подтвердить(Команда)
	
	Если СпособПодтвержденияКриптоопераций = ПредопределенноеЗначение("Перечисление.СпособыПодтвержденияКриптоопераций.ДолговременныйТокен") 
		и СпособПодтвержденияКриптоопераций <> НачальноеЗначениеСпособаПодтвержденияКриптооперации Тогда
		НовоеОповещение = ОписаниеОповещенияОЗакрытии;
		ОписаниеОповещенияОЗакрытии = Неопределено;
		ЗакрытьОткрытую(Неопределено);
		
		ЭлектроннаяПодписьВМоделиСервисаКлиент.ОтключитьПодтвержденияКриптоопераций(Сертификат, НовоеОповещение);
	Иначе	
		ОтразитьИзмененияСервер();
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("СпособПодтвержденияКриптоопераций", СпособПодтвержденияКриптоопераций);
		ПараметрыФормы.Вставить("Выполнено", Истина);
		ПараметрыФормы.Вставить("Состояние", "ПродолжитьПолучениеМаркераБезопасности");
		
		ЗакрытьОткрытую(ПараметрыФормы);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолноеПредставлениеСертификата(ОтпечатокСертификата)
	
	Результат					= "ОтпечатокСертификата";
	ИщемСертификат				= Новый Структура("Отпечаток", ОтпечатокСертификата);
	ДанныеСертификата		    = ХранилищеСертификатов.НайтиСертификат(ИщемСертификат);
	СвойстваСертификата			= Новый Структура("ДатаНачала, ДатаОкончания, Наименование");
	
	Попытка
		ЗаполнитьЗначенияСвойств(СвойстваСертификата, ДанныеСертификата);
	
		СертификатДействителенС 	= СвойстваСертификата.ДатаНачала;
		СертификатДействителенПо 	= СвойстваСертификата.ДатаОкончания;
		
		Если ТипЗнч(СертификатДействителенС) = Тип("Строка") Тогда 
			СертификатДействителенС = СтрЗаменить(СертификатДействителенС, Символ(10), "");
		КонецЕсли;
			
		Если ТипЗнч(СертификатДействителенПо) = Тип("Строка") Тогда 
			СертификатДействителенПо = СтрЗаменить(СертификатДействителенПо, Символ(10), "");
		КонецЕсли;
		
		Результат = СокрЛП(ДанныеСертификата.Наименование) + " (" + СертификатДействителенС + " - " + СертификатДействителенПо + ")";
	Исключение
		
	КонецПопытки;	
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьОтображениеСертификата()
	
	ПредставлениеСертификата = ПолноеПредставлениеСертификата(ОтпечатокСертификата);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСообщение(ТекстСообщения, Ожидать = Ложь, ЭтоОшибка = Ложь) 
	
	Элементы.Пояснение.Заголовок = ТекстСообщения;
	Если ЭтоОшибка Тогда 
		УстановитьЦветПоясненияПоПалитре("Красный");
	Иначе
		Элементы.Пояснение.ЦветТекста = Новый Цвет;
	КонецЕсли;	 
	
	Элементы.Пояснение.Видимость = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьНастройкиПолученияВременныхПаролейПослеВыполнения(Результат, ВходящийКонтекст) Экспорт 
	
	Результат = СервисКриптографииСлужебныйКлиент.ПолучитьРезультатВыполненияВФоне(Результат);
	
	Если Результат.Выполнено Тогда
		НастройкиТелефона   = Результат.РезультатВыполнения;
		Получатель 			= НастройкиТелефона.Телефон;
		ПоказатьСообщение("", Ложь);
		УправлениеФормой(ЭтотОбъект);
		
	Иначе	
		ПоказатьСообщение(НСтр("ru = 'Сервис отправки SMS-сообщений временно недоступен. Повторите попытку позже.'"), , Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	// показать текущий телефон
	Элементы.ИзменитьПолучателя.Заголовок = НСтр("ru = 'Изменить контакты'");
	Элементы.Подтвердить.Доступность = Форма.ШагАвторизации = 4; 
	
	// показать информацию о подтверждении операций с ключом
	Элементы.ГруппаИнформация.Видимость = Форма.СпособПодтвержденияКриптоопераций = ПредопределенноеЗначение("Перечисление.СпособыПодтвержденияКриптоопераций.СессионныйТокен");
	Элементы.ДекорацияОтступ.Видимость  = НЕ Элементы.ГруппаИнформация.Видимость;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПолучателя(Команда)
	
	Если ЦиклКриптооперации Тогда
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Состояние", "ИзменениеНастроекПолученияВременныхПаролей");
		ПараметрыФормы.Вставить("Сертификат", Сертификат);
		
		ЗакрытьОткрытую(ПараметрыФормы);
		
	Иначе
		ЗакрытьОткрытую(Неопределено);
		ЭлектроннаяПодписьВМоделиСервисаКлиент.ИзменитьНастройкиПолученияВременныхПаролей(Сертификат);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОтразитьИзмененияСервер()
	
	ЭлектроннаяПодписьВМоделиСервиса.НастроитьИспользованиеДолговременногоТокена(СпособПодтвержденияКриптоопераций, Сертификат);
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьЦветПоясненияПоПалитре(Цвет)  
		
	Элементы.Пояснение.ЦветТекста = ЦветаПалитры[Цвет];
			
КонецПроцедуры

#КонецОбласти
